#pragma once
/*
题目：

前十个自然数的平方和是：
1^2 + 2^2 + ... + 10^2 = 1 + 4 + 9 + 16 + ... + 100 = 385

前十个自然数的和的平方是：
(1 + 2 + ... + 10)*2 = 55^2 = 3025

所以平方和与和的平方的差是 3025 - 385 = 2640。
找出前一百个自然数的平方和与和平方的差。
*/

#include "basic_headers.h"

void resolution() {
    //num1 = (1 + 2 + 3 + ... + 100)^2
    //num2 = (1^2 + 2^2 + 3^2 + .. 100^2)
    //result = num1 - num2.

    //回顾公式 (a+b)^2 = a^2 + b^2 + 2ab
    // 公式 (a + b + c)^2 = a^2 + b^2 + c^2 + 2ab + 2ac + 2bc
    // 类推可得100个数相加后平方 比起 这一百个数各自的平方之和，要多出很多组 2*1*2 2*1*3 2*1*4 ... 2*99*100 
    // 故而，result 这些不同的数相乘之和

    size_t result = 0;
    for (size_t a = 1; a < 100; ++a) {
        for (size_t b = a + 1; b <= 100; ++b) {
            result += (2 * a * b);
        }
    }

    cout << "result is " << result << endl;
}
